Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: If you add the style $LVS_EX_CHECKBOXES to the ListView, then the borders are removed.
fr: Si vous ajoutez le style $LVS_EX_CHECKBOXES à la ListView, alors les bordures sont enlevées.

source: Add the style $WS_EX_CLIENTEDGE to display the borders.
fr: Ajoutez le style $WS_EX_CLIENTEDGE pour afficher les bordures.

source: The special flag $GUI_BKCOLOR_LV_ALTERNATE can be used with Listview control to give alternate background of the ListviewItems lines.
fr: Le commutateur spécial $GUI_BKCOLOR_LV_ALTERNATE peut être utilisée avec le contrôle Listview pour donner un fond alternatif des lignes des ListviewItems.

source: The odd lines will get the color set by GUICtrlSetBkColor() of the Listview control.
fr: Les lignes impaires obtiendront le jeu de couleurs par GUICtrlSetBkColor() du contrôle ListView.

source: The even lines will get the color set by GUICtrlSetBkColor() of the ListviewItem control.
fr: Les lignes paires obtiendront le jeu de couleurs par GUICtrlSetBkColor() du contrôle ListViewItem.

source: will change background color
fr: Change la couleur de fond

source: to allow drag and dropping
fr: pour permettre de glisser-déposer

source: subitemtext separated with Opt("GUIDataSeparatorChar").
fr: subitemtext séparé avec Opt("GUIDataSeparatorChar") .

source: controlID of the ListView control holding the item.
fr: controlID du contrôle ListView auquel l'item appartient.

source: This function creates the individual ListView items that can be selected.
fr: Cette fonction crée les différents items de ListView qui peuvent être sélectionnés.

source: The items function as normal controls and can be set with GUICtrlSetData().
fr: Les items fonctionnent comme des contrôles normaux et peuvent être définis avec GUICtrlSetData() .

source: Items can be deleted as with any other control by using GUICtrlDelete().
fr: Les items peuvent être supprimés comme n'importe quel autre contrôle à l'aide GUICtrlDelete() .

source: ListView items can be dragged and drop into an Edit or Input control with a $GUI_DROPACCEPTED state.
fr: Les items de ListView peuvent être glissés/déposés dans un contrôle Edit ou Input avec l'état ​​$GUI_DROPACCEPTED.

source: See GUICtrlCreateListView() about resizing of the column.
fr: Consultez GUICtrlCreateListView() sur le redimensionnement de la colonne.

source: The above constants are defined in #include <GUIConstantsEx.au3>
fr: Les constantes ci-dessus sont définies dans #include <GUIConstantsEx.au3>

source: The submenu text.
fr: Le texte du sous-menu.

source: If defined, allows you to create a submenu in the referenced menu.
fr: Si défini, vous permet de créer un sous-menu dans le menu référencé.

source: If equal -1 it refers to first level menu.
fr: Si égal à -1, il se réfère à premier niveau de menu.

source: Allows you to define the entry number to be created.
fr: Vous permet de définir le nombre d'entrée à créer.

source: The entries are numbered starting at 0.
fr: Les entrées sont numérotées à partir de 0.

source: create a separator line
fr: Crée une ligne de séparation

source: is created before "?" menu
fr: est créé avant \"?\" menu

source: Allows you to create a submenu in the referenced menu.
fr: Vous permet de créer un sous-menu dans le menu référencé.

source: If equal -1 it refers to the first level menu.
fr: Si égal à -1, il se réfère au premier menu de niveau.

source: 0 (default) = create a normal menuitem, 1 = create a menuradioitem
fr: 0 (par défaut) = créer un menuitem normal, 1 = créer un menuradioitem

source: If the Text parameter is a "" then a separator line is created.
fr: Si le paramètre de texte est un"", puis une ligne de séparation est créé.

source: GUICtrlSetState() can be used as for other controls.
fr: GUICtrlSetState() peut être utilisé comme pour les autres commandes.

source: Create a separator line
fr: Crée une ligne de séparation

source: Is created before "?" menu
fr: Est créé avant "?"menu

source: default (-1) : none.
fr: -par défaut ( -1 ) : aucun.

source: default (-1) :WS_EX_CLIENTEDGE
fr: -par défaut ( -1 ) : WS_EX_CLIENTEDGE

source: A variable pointing to a previously opened object
fr: Une variable qui pointe sur un objet précédemment ouvert

source: This function attempts to embed an 'ActiveX Control' or a 'Document Object' inside the GUI.
fr: Cette fonction tente d'intégrer un 'contrôle ActiveX' ou un 'Document Object' dans une GUI.

source: Not every control can be embedded.
fr: Pas tous les contrôles peuvent être intégrés.

source: They must at least support an 'IDispatch' interface.
fr: Ils doivent supporter au moins une interface 'IDispatch'.

source: See the Obj/COM Reference for more information about Objects.
fr: Consultez l'Obj/COM Reference pour plus d'informations sur les objets.

source: 'Document Objects' will only be visible if the Windows style $WS_CLIPCHILDREN has been used in GUICreate().
fr: 'Document Objects' ne sera visible que si le style Windows $WS_CLIPCHILDREN Windows a été utilisé dans GUICreate().

source: The GUI functions GUICtrlRead() and GUICtrlSet have no effect on this control.
fr: Les fonctions GUI GUICtrlRead() et GUICtrlSet n'ont aucun effet sur ce contrôle.

source: The object can only be controlled using 'methods' or 'properties' on the $ObjectVar.
fr: L'objet ne peut être contrôlée qu'en utilisant des 'méthodes' ou 'propriétés' de l'objet $ObjectVar.

source: Simple example:
fr: Exemple simple:

source: Embedding an Internet Explorer Object inside an AutoIt GUI
fr: Incorporation d'un objet Internet Explorer dans une GUI AutoIt

source: ; See also: http://msdn.microsoft.com/workshop/browser/webbrowser/reference/objects/internetexplorer.asp
fr: Consultez aussi : http://msdn.microsoft.com/workshop/browser/webbrowser/reference/objects/internetexplorer.asp

source: Create a simple GUI for our output
fr: Crée une GUI simple pour notre résultat

source: Show GUI
fr: Affiche l'interface utilisateur

source: filename of the picture to be loaded : supported types BMP, JPG, GIF(but not animated).
fr: Adresse de l'image à charger: types pris en charge BMP, JPG, GIF (mais sans animation).

source: 0 if picture cannot be created.
fr: Retourne 0 si le contrôle ne peut pas être créé.

source: To update the picture after the dialog box is displayed just use GUICtrlSetImage().
fr: Pour mettre à jour l'image lorsque le contrôle est affichée il suffit d'utiliser GUICtrlSetImage

source: To set the picture control to the same size as the file content set width and height to 0.
fr: Si vous voulez avoir une image ayant la même taille que le contenu du fichier il suffit d'utiliser width=height=0.

source: To have a transparent picture create the GUI with the WS_EX_LAYERED extended style.
fr: Pour avoir une image transparente, il est nécessaire pour créer la fenêtre GUI avec le style étendu WS_EX_LAYERED.

source: The left-top pixel will be used as the transparency color.
fr: Le pixel supérieur gauche est utilisé en tant que couleur de transparence.

source: If several pictures are created the last picture defines the transparent color.
fr: Si plusieurs photos sont créés la dernière photo définit la couleur de transparence.

source: See example 2.
fr: Consultez l'exemple 2.

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_PIC, newstyle, ...).
fr: Pour combiner des styles avec le style par défaut, utilisez BitOR($GUI_SS_DEFAULT_PIC, nouveau style,...).

source: If a picture is set as a background picture the other controls will overlap, so it is important to disable the pic control:
fr: Si une image est définie comme une image de fond, comme les autres contrôles se chevauchent, il est important de désactiver le contrôle d'image et de le créer après les autres contrôles:GUICtrlSetState(-1, $GUI_DISABLE).

source: GUICtrlSetState(-1, $GUI_DISABLE).
fr: Ce n'est pas suffisant pour l'onglet ou le contrôle ListView qui se comportent différemment.Dans ce cas, vous avez besoin de créer l'image avec le style $WS_CLIPSIBLINGS, GuiCtrlSetState(-1, $GUI_ONTOP) est nécessaire pour l'onglet, TreeView ou contrôle ListView.

source: The extended style $GUI_WS_EX_PARENTDRAG can be used to allow the dragging of the parent window for windows that do not have a titlebar (no $WS_CAPTION style in GUICreate()).
fr: Le style étendu $GUI_WS_EX_PARENTDRAG peut être utilisé pour permettre le glissement de la fenêtre parent pour les fenêtres qui n'ont pas de barre de titre (pas de style $WS_CAPTION dans GUICreate()).

source: The background is always set to transparent.
fr: Le fond est toujours mis à transparent.

source: GUICtrlSetBkColor() has no effect on pic control.
fr: GUICtrlSetBkColor() n'a pas d'effet sur le contrôle d'image.

source: PNG images can be used with GDI+.
fr: Les images PNG peuvent être utilisés avec GDI+.

source: See example 3.
fr: Consultez l'exemple 3.

source: resize the control
fr: Redimensionne le contrôle

source: PNG work around by Zedna
fr: PNG contourner par Zedna

source: Load PNG image
fr: Charger l'image PNG

source: Draw PNG image
fr: Dessinez l'image PNG

source: To update the bar position just use GUICtrlSetData().
fr: Pour mettre à jour la position de la barre il suffit d'utiliser GUICtrlSetData() .

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_PROGRESS, newstyle, ...
fr: Pour combiner des styles avec l'utilisation de style par défaut BitOR ($GUI_SS_DEFAULT_PROGRESS, newstyle,...

source: To use the values specified above you must #include <ProgressConstants.au3> in your script.
fr: Pour utiliser les valeurs spécifiées ci-dessus, vous devez ajouter #include <ProgressConstants.au3> dans votre script.

source: not working with Windows XP Style
fr: Ne fonctionne pas avec les styles de Windows XP

source: wait 20ms for next progressstep
fr: Attend 20 ms pour le prochain pas de la progression

source: progressbar-saveposition
fr: progressbar - Sauvegarde la position

source: save the current bar-position to $iSavPos
fr: sauve la position actuelle de la barre dans $iSavPos

source: $iSavPos=0
fr: $= 0 iSavPos

source: $BS_AUTORADIOBUTTON and $WS_TABSTOP if first radio in the group.
fr: $BS_AUTORADIOBUTTON et $WS_TABSTOP si premier radio-bouton du groupe.

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_RADIO, newstyle, ...
fr: Pour combiner des styles avec l'utilisation de style par défaut BitOR ($ GUI_SS_DEFAULT_RADIO, newstyle,...

source: will display an dialog box with 1 checkbox
fr: Affiche une boîte de dialogue avec une case à cocher

source: default (-1) :$TBS_AUTOTICKS
fr: -par défaut ( -1 ) : TBS_AUTOTICKS $

source: To set the min and max value use GUICtrlSetLimit().
fr: Pour définir les valeurs minimun et maximum utilisez GUICtrlSetLimit().

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_SLIDER, newstyle, ...
fr: Pour combiner des styles avec le style par défaut, utilisez BitOR ($GUI_SS_DEFAULT_SLIDER, newstyle,...

source: To use the values specified above you must #include <SliderConstants.au3> in your script.
fr: Pour utiliser les valeurs spécifiées ci-dessus, vous devez ajouter #include <SliderConstants.au3> dans votre script.

source: change min/max value
fr: Change les valeurs min/max

source: set cursor
fr: ensemble curseur

source: A tab control is a control which can only contain tabitem controls.
fr: Un contrôle onglet est un contrôle qui peut seulement contenir des contrôles TabItem.

source: Any other controls should be created within these tabitems using GUICtrlCreate... functions as shown in the example.
fr: Tous les autres contrôles devraient être créés dans ces TabItems à l'aide des fonctions GUICtrlCreate...comme dans l'exemple.

source: It is important to close the tab structure by creating a final tabitem control with a null text - GUICtrlCreateTabItem("").
fr: Il est important de fermer la structure tab en créant un contrôle final TabItem avec un texte null - GUICtrlCreateTabItem("").

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_TAB, newstyle, ...
fr: Pour combiner des styles avec le style par défaut, utilisez BitOR($ GUI_SS_DEFAULT_TAB, newstyle,...

source: To use the default value add #include <TabConstants.au3> in your script.
fr: Pour utiliser la valeur par défaut, ajoutez #include <TabConstants.au3> dans votre script.

source: A GUI can only hold a single tab control, but it is possible to create child GUIs each holding a tab control.
fr: Une GUI peut contenir un seul contrôle Tab, mais il est possible de créer des GUI enfants contenant chacun un contrôle Tab.

source: default Jon
fr: Jon défaut

source: will be display first
fr: sera affiché en premier

source: end tabitem definition
fr: fin de la définition de TabItem

source: To select a specific tabitem to be shown when the GUI opens use GUICtrlSetState(-1, $GUI_SHOW) as shown in the example.
fr: Pour sélectionner un TabItem spécifique à afficher lorsque la GUI s'ouvre, utilisez GUICtrlSetState( -1, $ GUI_SHOW ), comme illustré dans l'exemple.

source: Controls for a specific tabitem should be created after the tabitem and before the creating a further tabitem or closing the tab structure.
fr: Les contrôles pour un TabItem spécifique devraient être créés après la TabItem et avant la création d'une nouveau TabItem ou la fermeture de la structure du Tab.

source: To create a new control on an existing tabitem, use GUISwitch($hWin, $tabitem) to select the correct tabitem and then create the new control.
fr: Pour créer un nouveau contrôle dans un TabItem existant, utilisez GUISwitch($hWin, $tabitem) pour choisir le TabItem correct et ensuite créer le nouveau contrôle.

source: Do not forget to close the tabitem structure once again with GUICtrlCreateTabItem("").
fr: N'oubliez pas de fermer la structure TabItem avec GUICtrlCreateTabItem("").

source: The tabitem control cannot be colored (too much code ...).
fr: Le contrôle TabItem ne peut être coloré ( trop de code...).

source: GUICtrlRead() will return the index of the clicked tab item, or the controlID when advanced mode is used.
fr: GUICtrlRead() retournera l'index du TabItem cliqué, ou le controlID lorsque le mode avancé est utilisé.

source: display the clicked tab
fr: Affiche l'onglet cliqué

source: default (-1) :$TVS_HASBUTTONS, $TVS_HASLINES, $TVS_LINESATROOT, $TVS_DISABLEDRAGDROP, $TVS_SHOWSELALWAYS
fr: -défaut ( -1 ) : $TVS_HASBUTTONS, $TVS_HASLINES, $TVS_LINESATROOT, $TVS_DISABLEDRAGDROP, $TVS_SHOWSELALWAYS

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_TREEVIEW, newstyle, ...
fr: Pour combiner des styles avec le style par défaut, utiliser BitOR($GUI_SS_DEFAULT_TREEVIEW, newstyle,...

source: To use the values specified above you must #include <TreeViewConstants.au3> in your script.
fr: Pour utiliser les valeurs spécifiées ci-dessus, vous devez ajouter #include <TreeViewConstants.au3> dans votre script.

source: Hides the "aboutlabel"-text during initialization
fr: Masque le texte du "aboutlabel" lors de l'initialisation

source: Hides the "compinfo"-text during initialization
fr: Masque le texte de "CompInfo" lors de l'initialisation

source: Expand the "General"-item and paint in bold
fr: Développe l'item "Général" et le met en gras

source: Expand the "Display"-item and paint in bold
fr: Développe l'item "Display" et le met en gras

source: Toggle the bold painting
fr: Basculer la peinture gras

source: Get the controlID of the current selected treeview item
fr: Obtient le controlID de l'item de la TreeView en cours de sélection.

source: Get the text of the treeview item
fr: Obtenez le texte de l'élément d'arborescence

source: The following items will hide the other labels (1st and 2nd parameter) and then show the 'own' labels (3rd and 4th parameter)
fr: Les items suivants cacheront les autres labels (1er et 2nd paramètre), puis montre ses 'propres' labels (3ème et 4ème paramètre)

source: treeview identifier as return by treeview or treeviewitem creation if subtree is created.
fr: L'identificateur de la TreeView retourné lors de la création ou l'identificateur d'un TreeViewItem si un sous-arbre est créé.

source: For setting more information see GUICtrlUpdate...() functions.
fr: Pour plus d'informations consultez les fonctions GUICtrlUpdate...().

source: To paint a treeview item in bold (to show as default) use GUICtrlSetState($treeviewItem, $GUI_DEFBUTTON), to turn off this behaviour use GUICtrlSetState() with another value but $GUI_DEFBUTTON, for instance GUICtrlSetState($treeviewItem, 0).
fr: Pour mettre l'item d'un TreeView en gras (pour le définir comme l'item par défaut ) utilisez GUICtrlSetState($treeviewItem, $GUI_DEFBUTTON), pour annuler cette propriété utilisez GUICtrlSetState() avec une autre valeur que $GUI_DEFBUTTON, par exemple GUICtrlSetState($TreeViewItem, 0 ).

source: To expand a treeview item use GUICtrlSetState($treeviewItem, $GUI_EXPAND).
fr: Pour développer l'item d'un TreeView, utilisez GUICtrlSetState($TreeViewItem, $GUI_EXPAND).

source: To select a specific treeview item use GUICtrlSetState($treeviewItem, $GUI_FOCUS).
fr: Pour sélectionner un item spécifique d'un TreeView, utilisez GUICtrlSetState($TreeViewItem, $GUI_FOCUS ).

source: The controlID of the input control in which the updown control will be created, or -1 for the last created control.
fr: Le controlID du contrôle d'entrée dans lequel le contrôle updown sera créé, ou -1 pour le dernier contrôle créé.

source: default (-1) :$UDS_ALIGNRIGHT.
fr: -par défaut ( -1 ) : $UDS_ALIGNRIGHT.

source: $UDS_SETBUDDYINT and $UDS_ALIGNRIGHT if no align defined.
fr: $UDS_SETBUDDYINT et $UDS_ALIGNRIGHT si aucun alignement n'est défini.

source: To use the values specified above you must #include <UpDownConstants.au3> in your script.
fr: Pour utiliser les valeurs spécifiées ci-dessus, vous devez ajouter #include <UpDownConstants.au3> dans votre script.

source: Max and min value can be set with GUICtrlSetLimit().
fr: Les valeurs minimun et maximum peuvent être définies avec GUICtrlSetLimit() .

source: By default Windows increases the value when clicking the upper arrow button.
fr: Par défaut, Windows incrémente la valeur lors d'un clic sur le bouton flèche vers le haut.

source: Default height resizing is done according to the one of the related input control.
fr: Par défaut le redimensionnement de la hauteur se fait avec le contrôle d'entrée qui contient le contrôle UpDown.

source: Attempt to resize input control
fr: Tente de redimensionner le contrôle d'entrée

source: The control identifier (controlID) as returned by a GUICtrlCreate...() function, or -1 for the last created control.
fr: L'identifiant du contrôle (controlID) tel que retourné par une fonction GUICtrlCreate...(), ou -1 pour désigner le dernier contrôle créé.

source: For context menu controls see GUICtrlCreateContextMenu() remarks.
fr: Pour les contrôles de menu contextuel consultez GUICtrlCreateContextMenu()/Remarques.

source: the handle of the given control ID.
fr: Retourne le handle de l'ID du contrôle donné.

source: The following controls will not return a handle:
fr: Les contrôles suivants ne retourneront pas de handle:

source: GUICtrlCreateDummy(), GUICtrlCreateGraphic(), GUICtrlCreateObj(), GUICtrlCreateListViewItem() and GUICtrlCreateTabItem().
fr: GUICtrlCreateDummy(), GUICtrlCreateGraphic(), GUICtrlCreateObj(), GUICtrlCreateListViewItem() et GUICtrlCreateTabItem() .

source: ListViewItems and TabItems are managed through indexes.
fr: ListViewItems et TabItems sont gérés par des indices.

source: To get the index of these items use DllCall() and DllStructCreate().
fr: Pour obtenir l'indice de ces items utilisez DllCall() et DllStructCreate() .

source: BGR color value
fr: Valeur de couleur RGB

source: Apply the color to the menu
fr: Applique la couleur au menu

source: the state.
fr: Retourne l'état.

source: See GUICtrlSetState() for values.
fr: Consultez GUICtrlSetState() pour les valeurs.

source: -1 if control is not defined.
fr: Retourne -1 si le contrôle n'est pas définie.

source: As opposed to GUICtrlRead() this function returns ONLY the state of a control enabled/disabled/hidden/show/dropaccepted
fr: Par opposition à GUICtrlRead() cette fonction retourne ONLY l'état d'un contrôle activé/désactivé/caché/visible/qui accepte le drop

source: For ListView controls it returns the number of the clicked column.
fr: Pour le contrôle ListView, elle renvoie le nombre de colonnes cliquées.

source: checked
fr: vérifié

source: returns extended information of a control.
fr: Retourne des informations étendus d'un contrôle.

source: 0 = (Default) Returns a value with state or data of a control.
fr: 0 = (par défaut) Renvoie une valeur de l'état ou des données du contrôle.

source: 1 = Returns extended information of a control (see Remarks).
fr: 1 = Retourne des informations étendues du contrôle (Voir Remarques).

source: depends on the control (see below).
fr: Retourne une valeur qui dépend du contrôle (voir ci-dessous).

source: Value
fr: Valeur

source: state of the button.
fr: état du bouton.

source: See State table
fr: Consultez Tableau des états

source: The value selected
fr: La valeur sélectionnée

source: The text entered
fr: Le texte entré

source: The display text
fr: Le texte affiché

source: The selected date in the format defined by the regional settings
fr: La date sélectionnée dans le format défini par les paramètres régionaux

source: Current percentage
fr: Pourcentage en cours

source: Current value
fr: Valeur en cours

source: The index of the selected tabitem (0-based)
fr: L'index du TabItem sélectionné (en base 0)

source: State of the menu/item.
fr: État du menu/item.

source: Control identifier (controlID) of the selected TreeViewItem
fr: Identifiant du contrôle (controlID) du TreeViewItem sélectionné

source: State of the TreeViewItem
fr: État du TreeViewItem

source: Control identifier (controlID) of the selected ListViewItem.
fr: Identifiant du contrôle (controlID) du ListViewItem sélectionné.

source: 0 means no item is selected
fr: 0 signifie aucun item sélectionné

source: The text of the selected item/lines in the ListView
fr: Le texte de l'item/ligne sélectionné dans le ListView

source: The value set by GUICtrlSendToDummy or GUICtrlSetData
fr: La valeur définie par GUICtrlSendToDummy ou GUICtrlSetData

source: In 'advanced' mode the return value contains additional data of the control (see below).
fr: En mode 'avancé' la valeur de retour contient des données supplémentaires sur le contrôle (Voir ci-dessous).

source: Note: not all controls return additional data!
fr: Remarque: pas tous les contrôles renvoient des données supplémentaires!

source: Additional Value
fr: Valeurs supplémentaires

source: The text of the current selected TreeViewItem.
fr: Le texte du TreeViewItem actuellement sélectionné.

source: The text of the TreeViewItem.
fr: Le texte du TreeViewItem.

source: The state of the ListViewItem if $LVS_EX_CHECKBOXES exStyle used in advanced mode.
fr: L'état du ListViewItem si le style étendu $LVS_EX_CHECKBOXES est utilisé en mode avancé.

source: The controlID of the tabitem selected
fr: Le controlID du TabItem sélectionné

source: For Checkbox and Radio controls only the $GUI_CHECKED (1), $GUI_UNCHECKED (4) or $GUI_INDETERMINATE (2) states are returned so the value can be used directly.
fr: Pour les contrôles Checkbox et Radio seuls les états $GUI_CHECKED (1), $GUI_UNCHECKED (4) ou $GUI_INDETERMINATE (2) sont retournés, aussi la valeur peut être utilisée directement.
